
keyboard_neighbors = {
    'أ': ['غ', 'ت', 'ى', 'ﻻ', 'ل', 'إ', 'آ', 'ا'],
    'إ': ['غ', 'ت', 'ى', 'ﻻ', 'ل', 'أ', 'آ', 'ا'],
    'آ': ['غ', 'ت', 'ى', 'ﻻ', 'ل', 'إ', 'أ', 'ا'],
    'ا': ['غ', 'ت', 'ى', 'ﻻ', 'ل', 'إ', 'آ', 'أ'],
    'ب': ['ق', 'ل', 'ف', 'ر', 'ؤ', 'ي'],
    'ت': ['ع', 'ن', 'ة', 'ى', 'ا'],
    'ث': ['3', '4', 'ق', 'ي', 'س', 'ص'],
    'ج': ['-', '=', 'د', 'ط', 'ك', 'ح'],
    'ح': ['0', '-', 'ج', 'ك', 'م', 'خ'],
    'خ': ['9', '0', 'ح', 'م', 'ن', 'ه'],
    'د': ['=', '\\', 'ك', 'ط', 'ج'],
    'ذ': ['1'],
    'ر': ['ب', 'ل', 'ﻻ', 'ؤ'],
    'ز': ['م', 'ك', 'ظ', 'و'],
    'س': ['ص', 'ث', 'ي', 'ء', 'ئ', 'ش'],
    'ش': ['ض', 'ص', 'س', 'ئ'],
    'ص': ['2', '3', 'ث', 'س', 'ش', 'ض'],
    'ض': ['1', '2', 'ص', 'ش'],
    'ط': ['ج', 'د', 'ظ', 'ك'],
    'ظ': ['ك', 'ط', 'ز'],
    'ع': ['7', '8', 'ه', 'ت', 'ا', 'غ'],
    'غ': ['6', '7', 'ع', 'ا', 'ل', 'ف'],
    'ف': ['5', '6', 'غ', 'ل', 'ب', 'ق'],
    'ق': ['4', '5', 'ف', 'ب', 'ي', 'ث'],
    'ك': ['ح', 'ج', 'ط', 'ظ', 'ز', 'م'],
    'ل': ['ف', 'غ', 'ا', 'ﻻ', 'ر', 'ب'],
    'م': ['خ', 'ح', 'ك', 'ز', 'و', 'ن'],
    'ن': ['ه', 'خ', 'م', 'و', 'ة', 'ت'],
    'ه': ['8', '9', 'خ', 'ن', 'ت', 'ع'],
    'و': ['ن', 'م', 'ز', 'ة'],
    'ي': ['ث', 'ق', 'ب', 'ؤ', 'ء', 'س'],
    'ء': ['ي', 'س', 'ؤ', 'ئ'],
    'ة': ['ت', 'ن', 'و', 'ى'],
    'ئ': ['ش', 'س', 'ء'],
    'ؤ': ['ي', 'ب', 'ر', 'ء']
}

phonetic_mapping = {
    'ا': ['أ', 'ع'],  
    'أ': ['ا'],  
    'ب': [],  
    'ت': ['ط'],  
    'ث': ['س', 'ذ'],  
    'ج': ['ش'],  
    'ح': ['ه', 'خ'],  
    'خ': ['ح', 'غ'],  
    'د': ['ض'],  
    'ذ': ['ز', 'ظ', 'ث'],  
    'ر': ['غ', 'ل'],  
    'ز': ['ظ', 'ذ', 'س'],  
    'س': ['ث', 'ش', 'ص'],  
    'ش': ['س', 'ج'],  
    'ص': ['س', 'ز'],  
    'ض': ['د', 'ظ'],  
    'ط': ['ت', 'ض'],  
    'ظ': ['ز', 'ض', 'ذ'],  
    'ع': ['ا', 'غ'],  
    'غ': ['خ', 'ق', 'ع'],  
    'ف': [],  
    'ق': ['ك', 'غ'],  
    'ك': ['ق'],  
    'ل': ['ر'],  
    'م': ['ن'],  
    'ن': ['م'],  
    'ه': ['ح'],  
    'و': ['ؤ'],  
    'ي': ['ى', 'ئ'],  
    'ى': ['ي'],  
    'ؤ': ['و'],  
    'ئ': ['ي'],  
}


diacritic_mapping = {
    'َ': ['ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # fatha
    'ً': ['َ', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # tanween fatha
    'ُ': ['َ', 'ً', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # damma
    'ٌ': ['َ', 'ً', 'ُ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # tanween damma
    'ِ': ['َ', 'ً', 'ُ', 'ٌ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # kasra
    'ٍ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # tanween kasra
    'ْ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # sukoon
    'ّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # shadda
    'َّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # shadda + fatha
    'ًّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ُّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # shadda + tanween fatha
    'ُّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ٌّ', 'ِّ', 'ٍّ', ''],  # shadda + damma
    'ٌّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ِّ', 'ٍّ', ''],  # shadda + tanween damma
    'ِّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ٍّ', ''],  # shadda + kasra
    'ٍّ': ['َ', 'ً', 'ُ', 'ٌ', 'ِ', 'ٍ', 'ْ', 'ّ', 'َّ', 'ًّ', 'ُّ', 'ٌّ', 'ِّ', ''],  # shadda + tanween kasra
}
